In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [10]:
ser= pd.Series()
ser

Series([], dtype: float64)

In [11]:
ser=pd.Series([0,10,20,30,40,50,60,70,80,90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [12]:
ser= pd.Series([20,15.7,'10'])

ser

0      20
1    15.7
2      10
dtype: object

In [4]:
#Create Dictionary 
dict= {'A':[1,2,5],'B':[5,8,9],'C':[1,2,3]}

In [5]:
df=pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [16]:
#add new column and add values into it
df['States']= "CA NV AZ".split()

In [17]:
df

   A  B  C States
0  1  5  1     CA
1  2  8  2     NV
2  5  9  3     AZ

In [18]:
# how to create Nan values and its manipulation
dict= {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [8]:
df=pd.DataFrame(dict)

In [9]:
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [6]:
#Adding a new column D
df['D']= [20,30,40]
df

   A  B  C   D
0  1  5  1  20
1  2  8  2  30
2  5  9  3  40

In [7]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [12]:
dict= {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,4]}
df=pd.DataFrame(dict)

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  4

In [14]:
print(df.dropna(axis=1)) # Dropping any column with NA value.

   C
0  1
1  2
2  4

In [15]:
df['D']= [20,30,40]
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  4  40

In [16]:
print(df.dropna(axis=1))

   C   D
0  1  20
1  2  30
2  4  40

In [17]:
# droppoing any rows with NAN values
print(df.dropna(axis=0))

     A    B  C   D
0  1.0  5.0  1  20

In [18]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  4  40

In [19]:
# Filling values with default values 
print(df.fillna(value=50))

      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  30
2  50.0  50.0  4  40

In [20]:
#data frame remains the same, We will see we can save the dataframe later
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  4  40

In [21]:
#Filling values with computed values (mean of column C)
df.fillna(value=df['C'].mean(),inplace=True)  # inplace= True will save the changed dataframe.
print(df)

          A         B  C   D
0  1.000000  5.000000  1  20
1  2.000000  2.333333  2  30
2  2.333333  2.333333  4  40

In [22]:
#create data frame
data= {'Company':['Goog','Goog','Msft','Msft','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,350,124,243,359]}
df= pd.DataFrame(data)
df

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    Msft      Amy    350
3    Msft  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    359

In [23]:
# Grouping by company column and listing mean values.
byComp=df.groupby('Company')
print(byComp.mean())

         Sales
Company
FB       301.0
Goog     160.0
Msft     237.0

In [24]:
# Grouping by company column and listing sum values
print(byComp.sum())

         Sales
Company
FB         602
Goog       320
Msft       474

In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [4]:
Class_a= pd.DataFrame({'Math':[45,68,35,65],'Eng':[54,87,68,36],'Sci':[45,78,66,54],'Chem':[56,87,65,66]},index=['Ravi','Syam','Farhad','Abhi'])

Class_a

        Math  Eng  Sci  Chem
Ravi      45   54   45    56
Syam      68   87   78    87
Farhad    35   68   66    65
Abhi      65   36   54    66

In [5]:
Class_b= pd.DataFrame({'Math':[55,48,45,85],'Eng':[44,77,64,39],'Sci':[75,78,68,64],'Chem':[86,57,85,66]},index=['Shann','Nandita','Rushi','Prashant'])

Class_b

          Math  Eng  Sci  Chem
Shann       55   44   75    86
Nandita     48   77   78    57
Rushi       45   64   68    85
Prashant    85   39   64    66

In [6]:
Class_c= pd.DataFrame({'Math':[73,42,56,51],'Eng':[64,65,55,79],'Sci':[81,68,48,76],'Chem':[81,52,55,61]},index=['Ketan','Rajesh','Amol','Dhiraj'])

Class_c

        Math  Eng  Sci  Chem
Ketan     73   64   81    81
Rajesh    42   65   68    52
Amol      56   55   48    55
Dhiraj    51   79   76    61

In [7]:
all_students_marks=pd.concat([Class_a,Class_b,Class_c], axis=0)
print(all_students_marks)

          Math  Eng  Sci  Chem
Ravi        45   54   45    56
Syam        68   87   78    87
Farhad      35   68   66    65
Abhi        65   36   54    66
Shann       55   44   75    86
Nandita     48   77   78    57
Rushi       45   64   68    85
Prashant    85   39   64    66
Ketan       73   64   81    81
Rajesh      42   65   68    52
Amol        56   55   48    55
Dhiraj      51   79   76    61

In [9]:
all_students_marks=pd.concat([Class_a,Class_b,Class_c], axis=1)
print(all_students_marks)

          Math   Eng   Sci  Chem  Math   Eng   Sci  Chem  Math   Eng   Sci  \
Ravi      45.0  54.0  45.0  56.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Syam      68.0  87.0  78.0  87.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Farhad    35.0  68.0  66.0  65.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Abhi      65.0  36.0  54.0  66.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Shann      NaN   NaN   NaN   NaN  55.0  44.0  75.0  86.0   NaN   NaN   NaN
Nandita    NaN   NaN   NaN   NaN  48.0  77.0  78.0  57.0   NaN   NaN   NaN
Rushi      NaN   NaN   NaN   NaN  45.0  64.0  68.0  85.0   NaN   NaN   NaN
Prashant   NaN   NaN   NaN   NaN  85.0  39.0  64.0  66.0   NaN   NaN   NaN
Ketan      NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  73.0  64.0  81.0
Rajesh     NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  42.0  65.0  68.0
Amol       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  56.0  55.0  48.0
Dhiraj     NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  51.0  79.0  76.0

          Chem
Ravi       NaN
Syam       NaN
Farhad     NaN
Abhi       NaN
Shann      NaN
Nandita    NaN
Rushi      NaN
Prashant   NaN
Ketan     81.0
Rajesh    52.0
Amol      55.0
Dhiraj    61.0

In [10]:
df_cat2 =pd.concat([Class_a,Class_b,Class_c], axis=1)
print(df_cat2)

          Math   Eng   Sci  Chem  Math   Eng   Sci  Chem  Math   Eng   Sci  \
Ravi      45.0  54.0  45.0  56.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Syam      68.0  87.0  78.0  87.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Farhad    35.0  68.0  66.0  65.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Abhi      65.0  36.0  54.0  66.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Shann      NaN   NaN   NaN   NaN  55.0  44.0  75.0  86.0   NaN   NaN   NaN
Nandita    NaN   NaN   NaN   NaN  48.0  77.0  78.0  57.0   NaN   NaN   NaN
Rushi      NaN   NaN   NaN   NaN  45.0  64.0  68.0  85.0   NaN   NaN   NaN
Prashant   NaN   NaN   NaN   NaN  85.0  39.0  64.0  66.0   NaN   NaN   NaN
Ketan      NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  73.0  64.0  81.0
Rajesh     NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  42.0  65.0  68.0
Amol       NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  56.0  55.0  48.0
Dhiraj     NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  51.0  79.0  76.0

          Chem
Ravi       NaN
Syam       NaN
Farhad     NaN
Abhi       NaN
Shann      NaN
Nandita    NaN
Rushi      NaN
Prashant   NaN
Ketan     81.0
Rajesh    52.0
Amol      55.0
Dhiraj    61.0

In [11]:
df_cat2.fillna(value=0,inplace=True)
df_cat2

,Math,Eng,Sci,Chem,Math,Eng,Sci,Chem,Math,Eng,Sci,Chem
Ravi,45.0,54.0,45.0,56.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Syam,68.0,87.0,78.0,87.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Farhad,35.0,68.0,66.0,65.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Abhi,65.0,36.0,54.0,66.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
Shann,0.0,0.0,0.0,0.0,55.0,44.0,75.0,86.0,0.0,0.0,0.0,0.0
Nandita,0.0,0.0,0.0,0.0,48.0,77.0,78.0,57.0,0.0,0.0,0.0,0.0
Rushi,0.0,0.0,0.0,0.0,45.0,64.0,68.0,85.0,0.0,0.0,0.0,0.0
Prashant,0.0,0.0,0.0,0.0,85.0,39.0,64.0,66.0,0.0,0.0,0.0,0.0
Ketan,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,73.0,64.0,81.0,81.0
Rajesh,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,42.0,65.0,68.0,52.0
Amol,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,56.0,55.0,48.0,55.0
Dhiraj,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,51.0,79.0,76.0,61.0

In [12]:
#Merge
player_id_name= pd.DataFrame({'ID':[25,30,35,40,45,50,55],'Name':['Ronaldo','Messi','Pele','Maradona','Harry','Pogba','Chhetri'],})

player_id_name

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maradona
4  45     Harry
5  50     Pogba
6  55   Chhetri

In [15]:
player_details= pd.DataFrame({'ID':[25,30,45,50,55],'Age':[36,30,55,45,28],'Country':['Portugal','Argentina','England','France','India']})

player_details

   ID  Age    Country
0  25   36   Portugal
1  30   30  Argentina
2  45   55    England
3  50   45     France
4  55   28      India

In [16]:
pd.merge(player_id_name,player_details,on='ID')

   ID     Name  Age    Country
0  25  Ronaldo   36   Portugal
1  30    Messi   30  Argentina
2  45    Harry   55    England
3  50    Pogba   45     France
4  55  Chhetri   28      India

In [2]:
#Join
left= pd.DataFrame({'A':['A0','A1','A2',],'B'['B0','B1','B2']}, index=['K0','K1','K2'])
left

SyntaxError: invalid syntax (Temp/ipykernel_15200/3930749536.py, line 2)